SMEO ACC/integrator/kostya-test-acc/templates/getOpportunityDetailsFromICMore

<soapenv:Envelope xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/07/secext" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:opp="urn:crmondemand/ws/ecbs/opportunity/" xmlns:quer="urn:/crmondemand/xml/Opportunity/Query">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1">
         <wsse:UsernameToken>
            <wsse:Username>${headers.soapConnectorProperties.icMoreUsername}</wsse:Username>
            <wsse:Password Type="wsse:PasswordText">${headers.soapConnectorProperties.icMorePassword}</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <opp:OpportunityQueryPage_Input>
         <quer:ListOfOpportunity pagesize="50" startrownum="0" recordcountneeded="true">
            <!--Optional:-->
            <quer:Opportunity>
               <quer:Id>='${body.CustomObject1QueryPage_Output.ListOfCustomObject1.CustomObject1.OpportunityId}'</quer:Id>
               <quer:AccountId />
            </quer:Opportunity>
         </quer:ListOfOpportunity>
      </opp:OpportunityQueryPage_Input>
   </soapenv:Body>
</soapenv:Envelope>